In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("./data/titanic.csv")
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1. Build Model using titanic dataset 

Use the Pclass, Sex, Age, SibSp, Fare as X <br />
<br />
Survived column as y
<br 

Solve above classification problem also use standard scalar to process the input X data<br />
For training the model use 80:20 split for training and test data respetively.<br />
Calculate the accuracy of the model using sklearn - metrics packages<br />

## 2. Deploy the model

Use the standard scaler pickle file and classfier pickle file. <br />
Create an API using Flask.<br />

## Restaurant Reviews _ NLP Problem

1. Build the Sentiment classification model using the Restaurant reviews dataset
2. Use Tf-idf vectorizer function to process the data
3. Save the Tf-idf vectorized and classifier (KNN) pickle file
4. Deploy the model as an API using Flask in local machine

In [3]:
reviews_dataset = pd.read_csv("./data/Restaurant_Reviews.tsv.txt", delimiter="\t")

In [4]:
reviews_dataset.head()

                                              Review  Liked
0                           Wow... Loved this place.      1
1                                 Crust is not good.      0
2          Not tasty and the texture was just nasty.      0
3  Stopped by during the late May bank holiday of...      1
4  The selection on the menu was great and so wer...      1